Revit 2026 API

# ThermalAssetVaporPressure Property

---

The vapor pressure of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double VaporPressure { get; set; }
```
```vb
Public Property VaporPressure As Double
	Get
	Set
```
```cpp
public:
property double VaporPressure {
	double get ();
	void set (double value);
}
```
```fsharp
member VaporPressure : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for vaporPressure must be non-negative. |

Values are in kilograms per feet, squared-second (kg/(ft · s²)) and must be non-negative.

#### Reference

ThermalAsset Class

Autodesk.Revit.DB Namespace